import sys

n,m = map(int, input().split())

g = [list(map(int, input().split())) for _ in range(n)]

boards = [
    [
        [1,1,1,1],
        [0,0,0,0],
        [0,0,0,0],
        [0,0,0,0]
    ],
    [
        [1,0,0,0],
        [1,0,0,0],
        [1,0,0,0],
        [1,0,0,0]
    ],
    [
        [1,1,0,0],
        [1,1,0,0],
        [0,0,0,0],
        [0,0,0,0]
    ],
    [
        [1,0,0,0],
        [1,0,0,0],
        [1,1,0,0],
        [0,0,0,0]
    ],
    [
        [1,1,1,0],
        [1,0,0,0],
        [0,0,0,0],
        [0,0,0,0]
    ],
    [
        [1,1,0,0],
        [0,1,0,0],
        [0,1,0,0],
        [0,0,0,0]
    ],
    [
        [0,0,1,0],
        [1,1,1,0],
        [0,0,0,0],
        [0,0,0,0]
    ],
    [
        [0,1,0,0],
        [0,1,0,0],
        [1,1,0,0],
        [0,0,0,0]
    ],
    [
        [1,0,0,0],
        [1,1,1,0],
        [0,0,0,0],
        [0,0,0,0]
    ],
    [
        [1,1,0,0],
        [1,0,0,0],
        [1,0,0,0],
        [0,0,0,0]
    ],
    [
        [1,1,1,0],
        [0,0,1,0],
        [0,0,0,0],
        [0,0,0,0]
    ],
    [
        [1,0,0,0],
        [1,1,0,0],
        [0,1,0,0],
        [0,0,0,0]
    ],
    [
        [0,1,1,0],
        [1,1,0,0],
        [0,0,0,0],
        [0,0,0,0]
    ],
    [
        [0,1,0,0],
        [1,1,0,0],
        [1,0,0,0],
        [0,0,0,0]
    ],
    [
        [1,1,0,0],
        [0,1,1,0],
        [0,0,0,0],
        [0,0,0,0]
    ],
    [
        [1,0,0,0],
        [1,1,0,0],
        [1,0,0,0],
        [0,0,0,0]
    ],
    [
        [1,1,1,0],
        [0,1,0,0],
        [0,0,0,0],
        [0,0,0,0]
    ],
    [
        [0,1,0,0],
        [1,1,0,0],
        [0,1,0,0],
        [0,0,0,0]
    ],
    [
        [0,1,0,0],
        [1,1,1,0],
        [0,0,0,0],
        [0,0,0,0]
    ]
]

# ! 19가지 모든 경우의 수 생각
def isInner(x,y):
    if 0<=x<n and 0<=y<m:
        return True
    return False

#!  주어진 위치에 대하여 가능한 모든 모양 탐색, 최대 합 반환
def get_max_sum(startX,startY): # ! 현재 위치 기준으로 19개 모두 확인
    maxSum = 0
    for board in boards: # ! 보드 하나씩 꺼내 -> 4x4
        nowSum = 0
        for dx in range(4):
            for dy in range(4):
                if board[dx][dy] == 1: # ! 격자 부분의 합만 구해야지
                    if isInner(startX + dx, startY + dy):
                        nowSum += g[startX + dx][startY + dy]
        maxSum = max(maxSum,nowSum)
    return maxSum

MAX = -int(1e9)
for x in range(n):
    for y in range(m): # ! 현재 위치에서 매번 계산
        get = get_max_sum(x,y)
        MAX = max(MAX, get)
print(MAX)